"""
Напишите TCP-сервер, принимающий от клиента имя файла и возвращающий содержание этого файла
"""


def main():
    print("task21")


if __name__ == "__main__":
    main()
