"""
Напишите программу, которая выводит список всех выполняющихся в текущий момент системных демонов.
Рядом с каждым вывести адрес его конфигурационного файла.
"""


def main():
    print("task20")


if __name__ == "__main__":
    main()
